ERP.belugaerp/src/InformationRegisters/бг_ВходящиеДокументыУТМ/бг_ВходящиеДокументыУТМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ВходящиеДокументыУТМ</name>
  <resources>
    <name>ТекстОбъектаXDTO</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДокументОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбработанВERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыВходящихДокументовУТМ</types>
    </type>
  </resources>
  <resources>
    <name>ПопытокЗагрузить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторФСРАР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортныйМодуль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_СтатусыВходящихДокументовУТМ/бг_СтатусыВходящихДокументовУТМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыВходящихДокументовУТМ</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Дубль</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ТТНВходящаяЕГАИС/ТТНВходящаяЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТТНВходящаяЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_СоставУпаковок</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДоверительнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаТТН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перенаправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатусПроверкиИПодбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварВПутиПринадлежитГрузополучателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Упакована</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФорматОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>бг_УпаковкаПаллета</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_ФактическаяКрепость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерСправки2Поставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>17</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Шаг</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрузоотправительКод</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрузополучательКод</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТТН</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/ТТНИсходящаяЕГАИС/ТТНИсходящаяЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТТНИсходящаяЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДатаФиксацииЕГАИС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерФиксацииЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерСправки2Покупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/InformationRegisters/бг_ВходящиеДокументыУТМ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает данные не обработанных ранее записей регистра по указанному коду ФС РАР.
//
// Параметры:
//  ИдентификаторФСРАР - Строка - Код организации в ФС РАР
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица входящих для загрузки с колонками:
//     * АдресДокумента   - строка  
//     * Идентификатор    - строка
//     * ТекстОбъектаXDTO - ХранилищеЗначения
//
Функция ПоИдентификаторуФСРАР(ИдентификаторФСРАР) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторФСРАР", ИдентификаторФСРАР);
	Запрос.УстановитьПараметр("СтатусыКОбработке",  Перечисления.бг_СтатусыВходящихДокументовУТМ.КОбработке());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_ВходящиеДокументыУТМ.ИдентификаторФСРАР КАК ИдентификаторФСРАР,
	|	бг_ВходящиеДокументыУТМ.АдресДокумента КАК АдресДокумента,
	|	бг_ВходящиеДокументыУТМ.Идентификатор КАК Идентификатор,
	|	бг_ВходящиеДокументыУТМ.ТекстОбъектаXDTO КАК ТекстОбъектаXDTO
	|ИЗ
	|	РегистрСведений.бг_ВходящиеДокументыУТМ КАК бг_ВходящиеДокументыУТМ
	|ГДЕ
	|	бг_ВходящиеДокументыУТМ.ИдентификаторФСРАР = &ИдентификаторФСРАР
	|	И НЕ бг_ВходящиеДокументыУТМ.ОбработанВERP
	|	И бг_ВходящиеДокументыУТМ.Статус В(&СтатусыКОбработке)
	|	И бг_ВходящиеДокументыУТМ.ПопытокЗагрузить < 3
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторФСРАР,
	|	бг_ВходящиеДокументыУТМ.ДатаОперации,
	|	Идентификатор,
	|	АдресДокумента";
	
	ВходящиеДокументыУТМ = Запрос.Выполнить().Выгрузить();
	Если Не бг_КонстантыПовтИсп.ЗначениеКонстанты("НеОбрабатыватьПовторноЗаписиУТМСОдинаковымАдресомДокумента") Тогда
		Возврат ВходящиеДокументыУТМ;
	Иначе
		Возврат ВходящиеДокументыБезДублей(ВходящиеДокументыУТМ);
	КонецЕсли;
	
КонецФункции

// Возвращает данные регистра по указанным ключам записей.
//
// Параметры:
//  КлючиЗаписей - Массив из РегистрСведенийКлючЗаписи
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица входящих для загрузки с колонками:
//     * АдресДокумента   - строка  
//     * Идентификатор    - строка
//     * ТекстОбъектаXDTO - ХранилищеЗначения
//
Функция ПоКлючамЗаписей(КлючиЗаписей) Экспорт
	
	ПоляОтбора = Новый Массив;
	ПоляОтбора.Добавить(Метаданные.РегистрыСведений.бг_ВходящиеДокументыУТМ.Измерения.ИдентификаторФСРАР);
	ПоляОтбора.Добавить(Метаданные.РегистрыСведений.бг_ВходящиеДокументыУТМ.Измерения.АдресДокумента);
	
	ТаблицаОтбора = Новый ТаблицаЗначений;
	КолонкиОтбора = Новый Массив;
	Для Каждого Поле Из ПоляОтбора Цикл
		ТаблицаОтбора.Колонки.Добавить(Поле.Имя, Поле.Тип);
		КолонкиОтбора.Добавить(Поле.Имя)
	КонецЦикла;
	КолонкиОтбора = СтрСоединить(КолонкиОтбора, ","); 
	
	Для Каждого КлючЗаписи Из КлючиЗаписей Цикл 
		ЗаписьОтбора = ТаблицаОтбора.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьОтбора, КлючЗаписи);
	КонецЦикла;	
	ТаблицаОтбора.Свернуть(КолонкиОтбора);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаОтбора", ТаблицаОтбора);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_ВходящиеДокументыУТМ.ИдентификаторФСРАР КАК ИдентификаторФСРАР,
	|	бг_ВходящиеДокументыУТМ.АдресДокумента КАК АдресДокумента,
	|	бг_ВходящиеДокументыУТМ.Идентификатор КАК Идентификатор,
	|	бг_ВходящиеДокументыУТМ.ТекстОбъектаXDTO КАК ТекстОбъектаXDTO
	|ИЗ
	|	РегистрСведений.бг_ВходящиеДокументыУТМ КАК бг_ВходящиеДокументыУТМ
	|ГДЕ
	|	&ОтборПоКлючамВходящихДокументов
	|	И бг_ВходящиеДокументыУТМ.ПопытокЗагрузить < 3
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторФСРАР,
	|	бг_ВходящиеДокументыУТМ.ДатаОперации,
	|	Идентификатор,
	|	АдресДокумента";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ОтборПоКлючамВходящихДокументов",
			СтрШаблон("(%1) В (&ТаблицаОтбора)", КолонкиОтбора));	
	
	ВходящиеДокументыУТМ = Запрос.Выполнить().Выгрузить();
	Если Не бг_КонстантыПовтИсп.ЗначениеКонстанты("НеОбрабатыватьПовторноЗаписиУТМСОдинаковымАдресомДокумента") Тогда
		Возврат ВходящиеДокументыУТМ;
	Иначе
		Возврат ВходящиеДокументыБезДублей(ВходящиеДокументыУТМ);
	КонецЕсли;
	
КонецФункции

// Удаляет неактуальные записи в регистре сведений Входящие документы УТМ
// Параметры:
//	ДатаАктуальности - Дата - дата, до которой требуется удалить записи.
//	ИдентификаторФСРАР - Строка - код организации ЕГАИС.
//
Процедура УдалитьНеАктуальныеЗаписиУТМ(ДатаАктуальности, ИдентификаторФСРАР = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_ВходящиеДокументыУТМ.ИдентификаторФСРАР КАК ИдентификаторФСРАР,
	|	бг_ВходящиеДокументыУТМ.ТранспортныйМодуль КАК ТранспортныйМодуль,
	|	бг_ВходящиеДокументыУТМ.АдресДокумента КАК АдресДокумента,
	|	бг_ВходящиеДокументыУТМ.Грузоотправитель КАК Грузоотправитель,
	|	бг_ВходящиеДокументыУТМ.ДокументЕГАИС КАК ДокументЕГАИС,
	|	бг_ВходящиеДокументыУТМ.Идентификатор КАК Идентификатор,
	|	бг_ВходящиеДокументыУТМ.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.бг_ВходящиеДокументыУТМ КАК бг_ВходящиеДокументыУТМ
	|ГДЕ
	|	бг_ВходящиеДокументыУТМ.ДатаОперации < &ДатаАктуальности
	|	И &ОтборПоКодуФСРАР";
	
	Если ПустаяСтрока(ИдентификаторФСРАР) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоКодуФСРАР", "ИСТИНА");
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоКодуФСРАР",
			"бг_ВходящиеДокументыУТМ.ИдентификаторФСРАР = &ИдентификаторФСРАР");
		Запрос.УстановитьПараметр("ИдентификаторФСРАР", ИдентификаторФСРАР);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьДублирующиесяЗаписи(ИдентификаторФСРАР, ОрганизацияЕГАИС) Экспорт

	Если Не бг_КонстантыПовтИсп.ЗначениеКонстанты("НеОбрабатыватьПовторноЗаписиУТМСОдинаковымАдресомДокумента") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторФСРАР", ИдентификаторФСРАР);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("СтатусыКОбработке",  Перечисления.бг_СтатусыВходящихДокументовУТМ.КОбработке());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бг_ВходящиеДокументыУТМ.ИдентификаторФСРАР КАК ИдентификаторФСРАР,
	|	бг_ВходящиеДокументыУТМ.ТранспортныйМодуль КАК ТранспортныйМодуль,
	|	бг_ВходящиеДокументыУТМ.АдресДокумента КАК АдресДокумента,
	|	бг_ВходящиеДокументыУТМ.Грузоотправитель КАК Грузоотправитель,
	|	бг_ВходящиеДокументыУТМ.ДокументЕГАИС КАК ДокументЕГАИС,
	|	бг_ВходящиеДокументыУТМ.Идентификатор КАК Идентификатор,
	|	бг_ВходящиеДокументыУТМ.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.бг_ВходящиеДокументыУТМ КАК бг_ВходящиеДокументыУТМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕГАИСПрисоединенныеФайлы КАК ЕГАИСПрисоединенныеФайлы
	|		ПО бг_ВходящиеДокументыУТМ.АдресДокумента = ЕГАИСПрисоединенныеФайлы.бг_АдресДокумента
	|			И (ЕГАИСПрисоединенныеФайлы.бг_АдресДокумента <> """")
	|			И (ВЫБОР
	|				КОГДА ЕГАИСПрисоединенныеФайлы.Документ ССЫЛКА Документ.ТТНВходящаяЕГАИС
	|					ТОГДА ВЫРАЗИТЬ(ЕГАИСПрисоединенныеФайлы.Документ КАК Документ.ТТНВходящаяЕГАИС).ИдентификаторЕГАИС = бг_ВходящиеДокументыУТМ.ИдентификаторТТН
	|				КОГДА ЕГАИСПрисоединенныеФайлы.Документ ССЫЛКА Документ.ТТНИсходящаяЕГАИС
	|					ТОГДА ВЫРАЗИТЬ(ЕГАИСПрисоединенныеФайлы.Документ КАК Документ.ТТНИсходящаяЕГАИС).ИдентификаторЕГАИС = бг_ВходящиеДокументыУТМ.ИдентификаторТТН
	|				КОГДА бг_ВходящиеДокументыУТМ.Идентификатор <> """"
	|					ТОГДА бг_ВходящиеДокументыУТМ.Идентификатор = ЕГАИСПрисоединенныеФайлы.ИдентификаторЗапроса
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (бг_ВходящиеДокументыУТМ.Статус В (&СтатусыКОбработке))
	|			И (НЕ бг_ВходящиеДокументыУТМ.ОбработанВERP)
	|			И (бг_ВходящиеДокументыУТМ.ИдентификаторФСРАР = &ИдентификаторФСРАР)
	|			И (ЕГАИСПрисоединенныеФайлы.ВладелецФайла = &ОрганизацияЕГАИС)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		Запись.Статус = Перечисления.бг_СтатусыВходящихДокументовУТМ.Дубль;
		Запись.ОбработанВERP = Истина;
		
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВходящиеДокументыБезДублей(ВходящиеДокументыУТМ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документы.ИдентификаторФСРАР КАК ИдентификаторФСРАР,
	|	Документы.АдресДокумента КАК АдресДокумента,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ДанныеДляСвертки
	|ИЗ
	|	&ВходящиеДокументыУТМ КАК Документы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.ИдентификаторФСРАР КАК ИдентификаторФСРАР,
	|	Данные.АдресДокумента КАК АдресДокумента
	|ИЗ
	|	ДанныеДляСвертки КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.ИдентификаторФСРАР,
	|	Данные.АдресДокумента
	|ИМЕЮЩИЕ
	|	СУММА(Данные.Количество) > 1";
	
	Запрос.УстановитьПараметр("ВходящиеДокументыУТМ", ВходящиеДокументыУТМ);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ВходящиеДокументыУТМ;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	КлючПоискаЗаписей = Новый Структура("ИдентификаторФСРАР, АдресДокумента");
	КоличествоДокументовДолжноОстаться = 1;
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(КлючПоискаЗаписей, Выборка);
		ЗадублированныеЗаписи = ВходящиеДокументыУТМ.НайтиСтроки(КлючПоискаЗаписей);
		КоличествоДублей = ЗадублированныеЗаписи.ВГраница() - КоличествоДокументовДолжноОстаться;
		Для НомерЗаписи = 0 По КоличествоДублей Цикл 
			ВходящиеДокументыУТМ.Удалить(ЗадублированныеЗаписи[НомерЗаписи]);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ВходящиеДокументыУТМ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
